package ZaurStart.Lesson27;
/*
    Ключевое слово реализации интерфейсов implements
    Все методы в interface abstract and public;
    Если класс extand, то сначала пишется extend Employee, потом implements Work
    Класс может импленетировать несколько интерфейсов implements Work, Swim
    Класс должен перезаписать все методы интерфейса
                ******************
    1. Не возможно создать объект интерфейса - это не класс
    2. У интрфейса нет конструкторов
    3. Может быть только 1 интрефейс public
    4. Компилятор автоматически добавит abstract модификатор к интрефейсу
    5. Не может быть final
 */

public class InterfacesAbout {

}
